#!/usr/bin/env python
# -*- coding: utf-8 -*-

import time,datetime,re
import csv
import sys
import hronlib

ifl = open(sys.argv[1],"rb")

rdr = csv.reader(ifl)

ofl = open(sys.argv[2],"wb")

wrtr = csv.writer(ofl,dialect = 'excel')

patlst=[

# ["Хабаровск - MAXI Plus (гор/фед) (КТП) (SS)","02.10.09 00:00","31.12.09 23:59"],
# ["Хабаровск - MAXI Super (гор/фед) (КТП) (SS)","02.10.09 00:00","31.12.09 23:59"],
# ["Хабаровск - Много звонков (гор/фед) (КТП) (SS)","25.05.09 00:00","31.12.09 23:59"],
# ["Хабаровск - Говори свободно (гор/фед) (КТП) (SS)","16.02.09 00:00","31.12.09 23:59"],
# ["Хабаровск - МТС Коннект-2 (гор/фед) (КТП) (SS)","01.01.09 00:00","31.12.09 23:59"],
# ["Хабаровск - Эксклюзив07 (гор/фед) (КК) (SS)","01.01.09 00:00","31.12.09 23:59"],
# ["Хабаровск - Бизнес без границ (гор/фед) (КК) (SS)","01.01.09 00:00","31.12.09 23:59"]] #,

["Хабаровск - RED Energy (гор/фед) (ПРП) (IN)","25.08.09 00:00","31.12.09 23:59"],
["Хабаровск - Дилер (гор/фед) (ПРП) (IN)","01.01.09 00:00","31.12.09 23:59"],
["Хабаровск - Сотовый мир (фед) (ПРП) (IN)","01.01.09 00:00","31.12.09 23:59"],
["Хабаровск - Супер Ноль (гор/фед) (ПРП) (IN)","01.01.09 00:00","31.12.09 23:59"],
["Хабаровск - Длинные разговоры (гор/фед) (ПРП) (IN)","29.08.09 00:00","31.12.09 23:59"],
["Хабаровск - Классный (гор/фед) (ПРП) (IN)","01.01.09 00:00","31.12.09 23:59"],
["Хабаровск - Подружки (гор/фед) (ПРП) (IN)","01.01.09 00:00","31.12.09 23:59"],
["Хабаровск - Заботливый (гор/фед) (ПРП) (IN)","01.01.09 00:00","31.12.09 23:59"],
["Хабаровск - Супер Город (гор/фед) (ПРП) (IN)","01.01.09 00:00","31.12.09 23:59"],
["Хабаровск - Гостевой (гор/фед) (ПРП) (IN)","01.01.09 00:00","31.12.09 23:59"],
["Хабаровск - SIM (фед) (ПРП) (SS)","01.01.09 00:00","31.12.09 23:59"],
["Хабаровск - i-Онлайнер (фед) (ПРП) (SS)","01.01.09 00:00","31.12.09 23:59"],
["Хабаровск - Онлайнер (гор/фед) (ПРП) (IN)","19.06.09 00:00","31.12.09 23:59"]] 


# ["Хабаровск - Корпоративный Эксклюзив (гор/фед) (КОРП) (SS)","01.01.09 00:00","31.12.09 23:59"],
# ["Хабаровск - МТС-Коннект (гор/фед) (КОРП) (SS)","01.01.09 00:00","31.12.09 23:59"],
# ["Хабаровск - Авиатор (фед) (КОРП) (SS)","01.01.09 00ss:00","31.12.09 23:59"],
# ["Хабаровск - Престиж  (гор/фед) (КОРП) (SS)","01.01.09 00:00","31.12.09 23:59"],
# ["Хабаровск - Экспресс (гор/фед) (КОРП) (SS)","01.01.09 00:00","31.12.09 23:59"],
# ["Хабаровск - Команда07 (гор/фед) (КОРП) (SS)","01.01.09 00:00","31.12.09 23:59"],
# ["Хабаровск - Свой круг (гор/фед) (КОРП) (SS)","24.07.09 00:00","31.12.09 23:59"],
# ["Хабаровск - Бизнес сеть (гор/фед) (КОРП) (SS)","28.10.09 00:00","31.12.09 23:59"],
# ["Хабаровск - МТС-Коннект-2 (гор/фед) (КОРП) (SS)","01.01.09 00:00","31.12.09 23:59"],
# ["Хабаровск - Бизнес online (гор/фед) (КОРП) (SS)","28.10.09 00:00","31.12.09 23:59"],
# ["Хабаровск - Бизнес-модель (гор/фед) (КОРП) (SS)","01.01.09 00:00","31.12.09 23:59"],
# ["Хабаровск - Бизнес общение (гор/фед) (КОРП) (SS)","28.10.09 00:00","31.12.09 23:59"],
# ["Хабаровск - MAXI корпоративный (гор/фед) (КОРП) (SS)","01.01.09 00:00","31.12.09 23:59"],
# ["Хабаровск - Корпоративный мобайл + (гор/фед) (КОРП) (SS)","01.01.09 00:00","31.12.09 23:59"],
# ["Хабаровск - Корпоративный мобайл07 (гор/фед) (КОРП) (SS)","01.01.09 00:00","31.12.09 23:59"],
# ["Хабаровск - Эксклюзив07 корпоративный (гор/фед) (КОРП) (SS)","01.01.09 00:00","31.12.09 23:59"],
# ["Хабаровск - Бизнес без границ корпоративный (гор/фед) (КОРП) (SS)","01.01.09 00:00","31.12.09 23:59"],
# ["Хабаровск - Свой бизнес (гор/фед) (КОРП) (SS)","01.01.09 00:00","31.12.09 23:59"]]


# ["Хабаровск - Корпоративный Эксклюзив (гор/фед) (КОРП) (SS)","01.01.09 00:00","31.12.09 23:59"],
# ["Хабаровск - МТС-Коннект (гор/фед) (КОРП) (SS)","01.01.09 00:00","31.12.09 23:59"],
# ["Хабаровск - Авиатор (фед) (КОРП) (SS)","01.01.08 00:00","31.12.09 23:59"],
# ["Хабаровск - Престиж  (гор/фед) (КОРП) (SS)","01.01.08 00:00","31.12.09 23:59"],
# ["Хабаровск - Экспресс (гор/фед) (КОРП) (SS)","01.01.08 00:00","31.12.09 23:59"],
# ["Хабаровск - Команда07 (гор/фед) (КОРП) (SS)","17.09.08 00:00","31.12.09 23:59"],
# ["Хабаровск - Свой круг (гор/фед) (КОРП) (SS)","24.07.09 00:00","31.12.09 23:59"],
# ["Хабаровск - Бизнес сеть (гор/фед) (КОРП) (SS)","28.10.09 00:00","31.12.09 23:59"],
# ["Хабаровск - МТС-Коннект-2 (гор/фед) (КОРП) (SS)","24.11.08 00:00","31.12.09 23:59"],
# ["Хабаровск - Бизнес online (гор/фед) (КОРП) (SS)","28.10.09 00:00","31.12.09 23:59"],
# ["Хабаровск - Бизнес-модель (гор/фед) (КОРП) (SS)","19.11.08 00:00","31.12.09 23:59"],
# ["Хабаровск - Бизнес общение (гор/фед) (КОРП) (SS)","28.10.09 00:00","31.12.09 23:59"],
# ["Хабаровск - MAXI корпоративный (гор/фед) (КОРП) (SS)","01.01.08 00:00","31.12.09 23:59"],
# ["Хабаровск - Корпоративный мобайл + (гор/фед) (КОРП) (SS)","01.01.08 00:00","31.12.09 23:59"],
# ["Хабаровск - Корпоративный мобайл07 (гор/фед) (КОРП) (SS)","01.01.08 00:00","31.12.09 23:59"],
# ["Хабаровск - Эксклюзив07 корпоративный (гор/фед) (КОРП) (SS)","01.01.08 00:00","31.12.09 23:59"],
# ["Хабаровск - Бизнес без границ корпоративный (гор/фед) (КОРП) (SS)","01.01.08 00:00","31.12.09 23:59"],
# ["Хабаровск - Свой бизнес (гор/фед) (КОРП) (SS)","01.01.08 00:00","31.12.09 23:59"]]


# ["Еврейский АО - Команда07 (фед) (КОРП) (SS)","01.01.80 00:00","31.12.09 23:59"],
# ["Еврейский АО - МТС Коннект-2 (фед) (КТП) (SS)","01.01.80 00:00","31.12.09 23:59"],
# ["МР ДВ - Дилер GPRS (фед) (КТП) (SS)","01.01.80 00:00","31.12.09 23:59"],
# ["МР ДВ - СОРМ-1 (гор/фед) (КК) (SS)","01.01.80 00:00","31.12.09 23:59"],
# ["МР ДВ - Технический (гор/фед) (СПЕЦ) (SS)","01.01.80 00:00","31.12.09 23:59"],
# ["Приморье - MAXI (гор/фед) (КТП) (SS)","01.01.80 00:00","31.12.09 23:59"],
# ["Хабаровск - Корпорация II (гор/фед) (КОРП) (SS)","01.01.80 00:00","31.12.09 23:59"],
# ["Хабаровск - Корпорация III (гор/фед) (КОРП) (SS)","01.01.80 00:00","31.12.09 23:59"],
# ["Хабаровск - Корпорация III + Теам (гор/фед) (КТП) (SS)","01.01.80 00:00","31.12.09 23:59"],
# ["Хабаровск - Стандарт корп (гор/фед) (КОРП) (SS)","01.01.80 00:00","31.12.09 23:59"],
# ["Хабаровск - Тестовый 3G (гор/фед) (ПРП) (SS)","01.01.80 00:00","31.12.09 23:59"],
# ["Хабаровск - Дилер (гор/фед) (ПРП) (IN)","01.01.80 00:00","31.12.09 23:59"],
# ["Хабаровск - Профессионал (гор/фед) (КТП) (SS)","01.01.80","31.12.09"]]


# patlst = [
# ["","01.01.09 00:00","31.12.09 23:59",0,135]]
# ["","01.01.80 00:00","31.12.08 23:59",0,135]]
# ["","01.01.80 00:00","31.12.09 23:59",136,350]]
# ["","01.01.80 00:00","31.12.09 23:59",351,700]]
# ["","01.01.80 00:00","31.12.09 23:59",751,999999]]

an1=hronlib.str2dt("31.12.09 23:59")

sumarpu = 0
sumarpuAP = 0
lines = 0

# for rec in rdr:
#     try:
#         sumarpu = sumarpu + int(rec[3])
#         sumarpuAP = sumarpuAP + int(rec[4])
#         lines = lines + 1
#     except:
#         pass        
# print sys.argv[1], "  sumarpu=", sumarpu,"sumarpuAP=",sumarpuAP, "l=", lines

for rec in rdr:
    flg = True
    activ = hronlib.str2dt(rec[2])
    for pat in patlst:
        if rec[0].find(pat[0]) <> -1:
            # flg = False
            # break
            ldate = hronlib.str2dt(pat[1])
            rdate = hronlib.str2dt(pat[2])
            # larpu = int(pat[3])
            # rarpu = int(pat[4])
            # empty date of activation
            if rec[2]=="":
                # flg = False
                # break
                wrtr.writerow([rec[0],rec[1],rec[2],rec[3],rec[4],rec[5],timelive(rdate,ldate)/30.])
            try:
                # arpu = int(rec[3]) # ARPU without AP
                # arpu = int(rec[4]) # ARPU AP                
                if activ>=ldate and activ<=rdate: # and arpu>=larpu and arpu<rarpu:
                    # flg = False
                    # break
                    wrtr.writerow([rec[0],rec[1],rec[2],rec[3],rec[4],rec[5],timelive(rdate,activ)/30.])
            except:
                pass
    # if flg:
    #     wrtr.writerow([rec[0],rec[1],rec[2],rec[3],rec[4],rec[5]])

ifl.close()
ofl.close()
